untitled1/app/controllers/customers_controller.rb

INSERT INTO `customers` (`name`, `email`, `obs`, `created_at`, `updated_at`) VALUES ('Luan', 'email@email.com', 'observacao', '2018-05-29 19:37:31', '2018-05-29 19:37:31')
---
  def create
    @customer = Customer.new(customer_params)

    if @customer.save

UPDATE `customers` SET `name` = 'Luannn', `email` = 'emaillll@email.com', `obs` = 'observacaodassad', `updated_at` = '2018-05-29 19:38:27' WHERE `customers`.`id` = 1
---
  def update
    if @customer.update(customer_params)

DELETE FROM `customers` WHERE `customers`.`id` = 1
---
  def destroy
    @customer.destroy